Tekla Open API Reference for Tekla Structures 2025
ReinforcementSelectionForm.Culture Property
 Gets the culture.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CultureInfo Culture { get; set; }
Public Property Culture As CultureInfo
	Get
	Set
Property Value
Type: CultureInfo
See Also
Reference
ReinforcementSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace